# Задача 14: Требуется вывести все целые степени двойки (т.е. числа
# вида 2k
# ), не превосходящие числа N.
# 10 -> 1 2 4 8

n = 1000

# Введите ваше решение ниже

i = 0
number = 2 ** i
# print(number)
while number <= n:
    print(number)
    i += 1
    number = 2 ** i
